<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Microsoft OneDrive.</string>
    <key>Identifier</key>
    <string>com.github.macfanatic-ca-recipes.download.MSOneDrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSOneDrive</string>
        <key>DOWNLOAD_URL_BASE</key>
        <string>https://go.microsoft.com/fwlink/?linkid=823060</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL_BASE%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
