<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Microsoft Teams.</string>
    <key>Identifier</key>
    <string>com.github.macfanatic-ca-recipes.download.MSTeams</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSTeams</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://teams.microsoft.com/downloads/DesktopURL?env=production&amp;plat=osx</string>
                <key>re_pattern</key>
                <string>^https://statics.teams.microsoft.com/production-osx/.*/Teams_osx.dmg$</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
