<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Microsoft Office 365.</string>
    <key>Identifier</key>
    <string>team.classmate.autopkg-recipes.download.Office365</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Office365Suite</string>
        <key>DOWNLOAD_URL_BASE</key>
        <string>https://go.microsoft.com/fwlink/?linkid=525133</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL_BASE%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
