<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download and extract package for latest Daylite.</string>
    <key>Identifier</key>
    <string>ca.macfanatic.autopkg.pkg.daylite</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>ca.macfanatic.autopkg.download.daylite</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                  <dict>
                    <key>source_item</key>
                    <string>Install Daylite &amp; Mail Assistant.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>destination_item</key>
                    <string>%NAME%.pkg</string>
                  </dict>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
