<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest Daylite.</string>
    <key>Identifier</key>
    <string>com.github.macfanatic-ca-recipes.download.Daylite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Daylite</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.marketcircle.com/daylite/download/6/daylitedma/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                  <dict>
                    <key>source_item</key>
                    <string>Install Daylite &amp; Mail Assistant.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/</string>
                    <key>destination_item</key>
                    <string>%NAME%.pkg</string>
                  </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
