<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Install latest Daylite.</string>
    <key>Identifier</key>
    <string>ca.macfanatic.autopkg.install.daylite</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>ParentRecipe</key>
    <string>ca.macfanatic.autopkg.pkg.daylite</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
