<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Install latest Google Drive.</string>
    <key>Identifier</key>
    <string>ca.macfanatic.autopkg.install.GoogleDrive</string>
    <key>Input</key>
    <dict/>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>ca.macfanatic.autopkg.download.GoogleDrive</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>items_to_copy</key>
                <array>
                  <key>source_item</key>
                  <string>Google Drive.app</string>
                  <key>destination_path</key>
                  <string>/Applications/</string>
                </array>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
