<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs latest Harvest.</string>
    <key>Identifier</key>
    <string>com.github.macfanatic-ca-recipes.install.harvest</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.macfanatic-ca-recipes.download.harvest</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>Unarchiver</string>
          <key>Arguments</key>
          <dict>
            <key>archive_path</key>
            <string>%pathname%</string>
            <key>purge_destination</key>
            <true/>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
              <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
                <key>destination_path</key>
                <string>/Applications/%NAME%.app</string>
                <key>overwrite</key>
                <true/>
              </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/downloads/</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
