<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs latest 1Password.</string>
	<key>Identifier</key>
	<string>com.github.macfanatic-ca-recipes.install.1Password</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.macfanatic-ca-recipes.download.1Password</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
			<key>Arguments</key>
			<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
						<key>path_list</key>
						<array>
								<string>%RECIPE_CACHE_DIR%/downloads/</string>
						</array>
				</dict>
		</dict>
	</array>
</dict>
</plist>
