<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ON1 Resize 10.</string>
    <key>Identifier</key>
    <string>ca.macfanatic.autopkg.download.resize10</string>
    <key>Comment</key>
    <string>Check here for new DOWNLOAD_URL. https://on1help.zendesk.com/hc/en-us/articles/205534438-Product-Downloads-for-ON1-owners</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Resize10</string>
        <key>DOWNLOAD_URL</key>
        <string>http://ononesoft.cachefly.net/resize10/mac/ON1_Resize_10.5.2.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                  <dict>
                    <key>source_item</key>
                    <string>ON1 Resize 10.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/</string>
                    <key>destination_item</key>
                    <string>%NAME%.pkg</string>
                  </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
